In [2]:
import pandas as pd
import numpy as np
import seaborn as sb

import matplotlib.pyplot as plt # 시각화 지원
import matplotlib
matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus']=False

In [4]:
data = [{'eng':30,'kor':70,'math':100},
       {'eng':40,'kor':80,'math':10},
       {'eng':50,'kor':90,'math':20},
       {'eng':60,'kor':100,'math':30},
       {'eng':70,'kor':10,'math':40}]
df =pd.DataFrame(data,index=['aa','bb','cc','dd','ee'])
df

    eng  kor  math
aa   30   70   100
bb   40   80    10
cc   50   90    20
dd   60  100    30
ee   70   10    40

In [31]:
# 파일 읽어오기
# index_col = label'은 label을 인덱스로 빼줌
pd.read_csv('b.csv',index_col='label')

       eng  kor  math
label
aa      30   70   100
bb      40   80    10
cc      50   90    20
dd      60  100    30
ee      70   10    40

In [33]:
# 높은 점수로 부터 3번째까지
df.nlargest(3,'kor') # 국어점수 탑 3

    eng  kor  math
dd   60  100    30
cc   50   90    20
bb   40   80    10

In [36]:
df['eng'].nlargest(3) # 영어 점수 탑3

ee    70
dd    60
cc    50
Name: eng, dtype: int64

In [41]:
df.loc['bb','eng']=70
df

    eng  kor  math
aa   30   70   100
bb   70   80    10
cc   50   90    20
dd   60  100    30
ee   70   10    40

In [44]:
df['eng'].nlargest(3,keep='all')

bb    70
ee    70
dd    60
Name: eng, dtype: int64

In [20]:
# sep=',' 인자를 구분된 /, .등으로 분류해서 읽어옴
# 첫번째 로우는 컬럼명으로 지정하지 않겠다. header =None
# index_col은 앞부분 컬럼을 인덱스로 빼줌

birthDF =pd.read_csv('data/births.txt', index_col=0 )
birthDF.columns=['남아수', '여아수'] # 컬럼명 설정
birthDF.index.name='년도' # 로우명 설정
birthDF

          남아수      여아수
년도
1881    91954   100745
1882   107850   113688
1883   112321   104629
1884   129022   114445
1885   133055   107800
...       ...      ...
2007  1919408  2072139
2008  1887234  2036289
2009  1832925  1979303
2010  1772738  1913851
2011  1753500  1893230

[131 rows x 2 columns]

In [27]:
# 컬럼별로 출력, Series 형태
def fn(v):
    print('v=',v)
    print("==============")
    return v.sum()#v['aa'] # 해당 인덱스명의 값만 반환

In [30]:
# axis=1 로우별로 출력
df.apply(fn,axis=1)

v= eng      30
kor      70
math    100
Name: aa, dtype: int64
==============
v= eng     40
kor     80
math    10
Name: bb, dtype: int64
==============
v= eng     50
kor     90
math    20
Name: cc, dtype: int64
==============
v= eng      60
kor     100
math     30
Name: dd, dtype: int64
==============
v= eng     70
kor     10
math    40
Name: ee, dtype: int64
==============

aa    200
bb    130
cc    160
dd    190
ee    120
dtype: int64